//循环体内又包含了循环语句

//【利用嵌套打印一组星图】

#include<iostream>
using namespace std;
int main()
{
	//利用嵌套打印一组星图
	int i;
	//外行执行一次 内行执行一周
	for (i = 0; i < 10; i++)
	{
		//内行循环
		for (int j = 0; j < 10; j++)  //打印多少个（执行j=1 2 3 4 5 6 7 8 9）
		{
			cout << "!";
		}
		cout << endl;  //换新行
	}
	system("pause");
	return 0;
}

/*
!!!!!!!!!!
!!!!!!!!!!
!!!!!!!!!!
!!!!!!!!!!
!!!!!!!!!!
!!!!!!!!!!
!!!!!!!!!!
!!!!!!!!!!
!!!!!!!!!!
!!!!!!!!!!
*/

//【打印9*9乘法表】
#include<iostream>
using namespace std;
int main()
{
	//乘法口诀表
	int i, j;
	//外循环一次，内循环一圈。
	for (i = 1; i <= 9; i++)
	{
		//内循环
		for (j = 1; j <= i; j++)      
		{
			cout << j << "*" << i << "=" << j*i<<"	"; //输出j*i的值 
		}
		cout << endl; 
	}
	system("pause");  
	return 0;
}
/* 
1*1=1
1*2=2   2*2=4
1*3=3   2*3=6   3*3=9
1*4=4   2*4=8   3*4=12  4*4=16
1*5=5   2*5=10  3*5=15  4*5=20  5*5=25
1*6=6   2*6=12  3*6=18  4*6=24  5*6=30  6*6=36
1*7=7   2*7=14  3*7=21  4*7=28  5*7=35  6*7=42  7*7=49
1*8=8   2*8=16  3*8=24  4*8=32  5*8=40  6*8=48  7*8=56  8*8=64
1*9=9   2*9=18  3*9=27  4*9=36  5*9=45  6*9=54  7*9=63  8*9=72  9*9=81
*/