/* *********************************************************************************
                                    数据类型
  C++规定在创建一个变量或者常量时，必须指定出相应的数据类型，否则无法给变量分配内存。
1.整形
作用：表示的是整数类型的数据。
C++表示整形的类型有：

  数据类型             占用空间             取值范围
short (短整型)           2字节           (-2^15--2^15-1)
int（整型）              4字节           (-2^31--2^31-1)
long（长整型）           4字节           (-2^31--2^31-1)
long long(长长整型)      8字节           (-2^63--2^63-1)

区别：所占内存空间不同。
********************************************************************************** */
#include <iostream>
using namespace std;
int main()
{
	//short (短整型)   (-32768--32767)
	short num1 = 32767;
	short num2 = 32768;  //用来验证超出范围后会发生什么？
	short num3 = 32769;  //结论:当超出最大内存空间时，时从负值重新开始赋值。
	//int（整型）
	int num4 = 10;
	//long（长整型）
	long num5 = 10;
	// long long(长长整型)
	long long num6 = 10;

	cout << "num1=" << num1 << endl;
	cout << "num2=" << num2 << endl;
	cout << "num3=" << num3 << endl;
	cout << "num4=" << num4 << endl;
	cout << "num5=" << num5 << endl;
	cout << "num6=" << num6 << endl;
	system("pause");
	return 0;
}
