/* ****
二维数组定义方式
【1】int a[3][4]={{1,2,3,4},{4,5,6,7},{7,8,9,1}};  //
【2】int b[3][4]={1,2,3,4,5,6,7,8,9};
      * 1 2 3 4
	  * 4 5 6 7
	  *	7 8 9 1
	 
【3】int c[][3]={{1,2,3},{4,5,6}};
	  *1 2 3
	  *4 5 6 
	     
【4】int d[3][3]={{1},{4,5},{7,8,9}};  //初始化部分元素 其余为0
      *1 0 0
	  *4 5 0
	  *7 8 9

*****/

#include<iostream>
using namespace std;
int main()
{
	/*int LDY[2][3];    //定义方式
	LDY[0][0] = 1;
	LDY[0][1] = 1;
	LDY[0][2] = 9;
	LDY[0][3] = 7;
	LDY[1][0] = 2;*/

	int b[3][4] = { 1,2,3,4,5,6,7,8,9 };
	int i;
	int j;

	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 4; j++)
		{
			cout << b[i][j] << "	";
		}
		cout << endl;
	}
	system("pause");
	return 0;
}